0Bu/daikin-altherma-esp32/main/http_config.cpp
static esp_err_t test_circulation(httpd_req_t* req) {
    if (!config().diagnostics_enabled)
        return send_err(req, "409 Conflict", "Enable plant diagnostics before testing this source");
    CirculationRequest in;
    if (const char* error = parse_circulation_request(req, in))
        return send_err(req, "400 Bad Request", error);
    if (in.topic.empty()) return send_err(req, "400 Bad Request", "MQTT topic is required for a test");
    const CirculationSourceTestResult result =
        mqtt_circulation_test(circulation_test_config(in), 12000);
    if (!result.passed)
        return send_err(req, "422 Unprocessable Entity",
                        result.error.empty() ? "No fresh MQTT value received" : result.error.c_str());
    char response[256];
    std::snprintf(response, sizeof(response),
                  "{\"ok\":true,\"test_proof\":%lu,\"power_w\":%.6g,"
                  "\"state\":\"%s\",\"retained\":%s}",
                  static_cast<unsigned long>(result.proof), result.power_w,
                  circulation_power_state_name(result.state), result.retained ? "true" : "false");
    return http_send_json(req, response);
}

// POST /set_diagnostics {enabled:boolean}. This is the one opt-in boundary for the rolling checkup,
// heating-curve evaluation and their external source collection. It is deliberately not the retired
// dynamic-LWT controller mode: no write path exists, and ordinary X10A/HomeHub telemetry is untouched.
// Every transition gets a new generation before any runtime producer is woken, so RAM/flash evidence
// from an earlier interval fails closed even across a power loss immediately after this response.
static esp_err_t set_diagnostics(httpd_req_t* req) {
    char body[128];
    if (http_read_body(req, body, sizeof(body)) < 0)
        return send_err(req, "400 Bad Request", "bad body");
    cJSON* j = cJSON_Parse(body);
    if (!j) return send_err(req, "400 Bad Request", "bad json");
    cJSON* item = cJSON_GetObjectItemCaseSensitive(j, "enabled");
    if (!cJSON_IsBool(item)) {
        cJSON_Delete(j);
        return send_err(req, "400 Bad Request", "enabled must be boolean");
    }
    const bool enabled = cJSON_IsTrue(item);
    cJSON_Delete(j);

    Config c = config();
    if (c.diagnostics_enabled == enabled)
        return http_send_json(req, "{\"ok\":true,\"saved\":false,\"reboot\":false}");
    const bool weather_was_publishable = c.diagnostics_enabled && c.weather_enabled;
    c.diagnostics_enabled = enabled;
    c.diagnostics_generation = diagnostics_next_generation(c.diagnostics_generation);
    WeatherSourceChange weather_change(c.weather_enabled, enabled);
    if (!weather_change)
        return send_err(req, "503 Service Unavailable",
                        "weather request still active; retry diagnostics change");
    if (!config_save(c)) return send_err(req, "500 Internal Server Error", "config write failed");
    weather_change.commit();

    checkup_set_diagnostics(enabled, c.diagnostics_generation);
    history_checkup_reset();
    history_circulation_reset();
    mqtt_reference_reconfigure();
    mqtt_circulation_reconfigure();
    if (weather_was_publishable && !enabled) mqtt_request_weather_cleanup();
    weather_forecast_reconfigure();
    diag_printf("diagnostics: %s (generation %lu)\n", enabled ? "enabled" : "disabled",
                static_cast<unsigned long>(c.diagnostics_generation));
    return http_send_json(req, "{\"ok\":true,\"saved\":true,\"reboot\":false}");
}

static esp_err_t set_circulation(httpd_req_t* req) {
    CirculationRequest in;
    if (const char* error = parse_circulation_request(req, in))
        return send_err(req, "400 Bad Request", error);
    const CirculationSourceTestConfig tested = circulation_test_config(in);
    if (!in.topic.empty() && !mqtt_circulation_test_proof_valid(in.test_proof, tested))
        return send_err(req, "409 Conflict", "Test this MQTT mapping successfully before saving");

    Config c = config();
    if (c.circulation_name == in.name && c.circulation_topic == in.topic &&
        c.circulation_power_path == in.power_path && c.circulation_time_path == in.time_path &&
        c.circulation_max_age_s == in.max_age_s &&
        c.circulation_on_tenths_w == in.on_tenths_w &&
        c.circulation_off_tenths_w == in.off_tenths_w &&
        c.circulation_confirm_s == in.confirm_s) {
        return http_send_json(req, "{\"ok\":true,\"saved\":false,\"reboot\":false}");
    }
    const bool evidence_mapping_changed =
        c.circulation_topic != in.topic ||
        c.circulation_power_path != in.power_path ||
        c.circulation_time_path != in.time_path ||
        c.circulation_max_age_s != in.max_age_s ||
        c.circulation_on_tenths_w != in.on_tenths_w ||
        c.circulation_off_tenths_w != in.off_tenths_w ||
        c.circulation_confirm_s != in.confirm_s;
    c.circulation_name = in.name;
    c.circulation_topic = in.topic;
    c.circulation_power_path = in.power_path;
    c.circulation_time_path = in.time_path;
    c.circulation_max_age_s = in.max_age_s;
    c.circulation_on_tenths_w = in.on_tenths_w;
    c.circulation_off_tenths_w = in.off_tenths_w;
    c.circulation_confirm_s = in.confirm_s;
    if (!config_save(c)) return send_err(req, "500 Internal Server Error", "config write failed");
    if (evidence_mapping_changed) mqtt_circulation_reconfigure();
    diag_printf("mqtt: circulation power mapping saved%s\n", in.topic.empty() ? " (disabled)" : "");
    return http_send_json(req, "{\"ok\":true,\"saved\":true,\"reboot\":false}");
}

static esp_err_t set_hp(httpd_req_t* req) {
    char body[2048];
    if (http_read_body(req, body, sizeof(body)) < 0) return send_err(req, "400 Bad Request", "bad body");
    cJSON* j = cJSON_Parse(body);
    if (!j) return send_err(req, "400 Bad Request", "bad json");
    Config c    = config();
    const bool modbus_was_enabled = config_modbus_enabled(c);
    const std::string old_mb_host = c.mb_host;
    const int old_mb_port = c.mb_port;
    const int old_mb_unit = c.mb_unit_id;
    // The RX/TX pins are the physical X10A wiring: PERSISTED so a manual override survives a reboot
    // (config_save below). The model "profile" is session-only — only touched when the request
    // explicitly sends "profile"; a wiring-only patch omits it so it does not re-select the model or
    // invalidate a settled fingerprint (which would force a spurious re-detect next poll).
    cJSON* profItem     = cJSON_GetObjectItem(j, "profile");
    bool   profile_sent = cJSON_IsString(profItem);
    cJSON* rxItem       = cJSON_GetObjectItem(j, "rx");
    cJSON* txItem       = cJSON_GetObjectItem(j, "tx");
    const bool x10a_sent = set_hp_updates_x10a(
        profile_sent, cJSON_IsNumber(rxItem), cJSON_IsNumber(txItem));
    const int old_rx = c.rx_pin;
    const int old_tx = c.tx_pin;
    // "auto" (the UI's only value) requests a fresh detection; a concrete id pins the model for this
    // session (accepted for API flexibility, never offered in the UI).
    if (profile_sent) c.profile = profItem->valuestring;
    if (set_hp_clears_fingerprint(profile_sent, c.profile)) c.fp_valid = false;
    // proto is auto-detected (hp_detect.cpp), not set from the UI.
    c.rx_pin    = ji(j, "rx", c.rx_pin);
    c.tx_pin    = ji(j, "tx", c.tx_pin);
    const bool reset_checkup =
        set_hp_resets_checkup(profile_sent, old_rx, old_tx, c.rx_pin, c.tx_pin);
    if (reset_checkup) c.x10a_identity_fp = 0;  // replaced below only for a committed manual model
    // The HomeHub Modbus stack (issue #32). All optional — an omitted key keeps its stored value, so
    // a wiring-only patch (rx/tx) leaves the HomeHub untouched and the pin picker's
    // {profile:"auto",rx,tx} POST cannot switch anything on. This is a SECOND source, not an
    // alternative to X10A: enabling it starts a separate task, it does not stop the X10A poll.
    // HomeHub configuration has one unambiguous explicit decision: sending mb_host (including an
    // empty string) completes the one-shot discovery lifecycle. Non-empty enables polling; empty is
    // the durable opt-out, with no later boot search or HomeHub request. /discover_homehub remains a
    // request-local manual action and never mutates config behind the form's Save/Cancel boundary.
    cJSON* hostItem = cJSON_GetObjectItem(j, "mb_host");
    cJSON* portItem = cJSON_GetObjectItem(j, "mb_port");
    cJSON* unitItem = cJSON_GetObjectItem(j, "mb_unit_id");
    const bool host_sent = cJSON_IsString(hostItem);
    const bool homehub_sent = host_sent || cJSON_IsNumber(portItem) || cJSON_IsNumber(unitItem);
    if (!set_hp_update_domains_compatible(x10a_sent, homehub_sent)) {
        cJSON_Delete(j);
        return send_err(req, "400 Bad Request",
                        "update X10A and HomeHub in separate requests");
    }
    if (host_sent) {
        c.mb_host = hostItem->valuestring;
        c.mb_discovery_done = true;
    }
    c.mb_port           = ji(j, "mb_port", c.mb_port);
    c.mb_unit_id        = ji(j, "mb_unit_id", c.mb_unit_id);
    // `actuation_enabled` is deliberately NOT accepted: the register-54 write path is retired (#294)
    // and an accepted-but-inert field would read like a capability that still exists.
    const bool reset_mb_history = homehub_history_identity_changed(
        old_mb_host, old_mb_port, old_mb_unit, c.mb_host, c.mb_port, c.mb_unit_id);
    cJSON_Delete(j);
    std::string reason;
    // Pass the real Kconfig-derived octal-SPI + status-LED facts (config.cpp) so validate() rejects a
    // chip-reserved GPIO — a flash/strapping/JTAG pad the UI dropdown never offers but a raw curl POST
    // could send — with the pin named, instead of range-accepting it and persisting a crash-loop pair.
    if (!validate(c, reason, SOC_GPIO_PIN_COUNT - 1, hw_octal_spi(),
                  config_reserved_pins(c).plus(net_eth_reserved_pins())))
        return send_err(req, "400 Bad Request", reason.c_str());
    // A selected preset adds the PCB fact the generic ESP32-S3 validator cannot know: only pads
    // physically routed to this board's headers may carry X10A. Apply it only when THIS PATCH makes
    // an X10A statement. /set_hp also owns the independent HomeHub fields; rejecting an empty-host
    // disable because untouched legacy pins do not belong to a later-selected board makes HomeHub
    // impossible to turn off. A raw/stale X10A request still cannot persist such a pair.
    if (x10a_sent) {
        if (const BoardPreset* board = board_selected_preset(c)) {
            const ReservedPins used = config_reserved_pins(c).plus(net_eth_reserved_pins());
            if (!board_preset_x10a_pin_offerable(board, c.rx_pin, hw_octal_spi(), used))
                return send_err(req, "400 Bad Request", "rx_pin is not available on selected board");
            if (!board_preset_x10a_pin_offerable(board, c.tx_pin, hw_octal_spi(), used))
                return send_err(req, "400 Bad Request", "tx_pin is not available on selected board");
        }
    }
    // A concrete API profile is a committed decoding contract even though the UI always requests
    // auto-detection. Give that manual contract the same stable profile/link scope as detection;
    // otherwise history_reset() would leave target_fp=0 forever because no detect cycle runs. A
    // wiring-only raw patch while a concrete profile is already active follows the same rule.
    if (reset_checkup && c.profile != "auto")
        c.x10a_identity_fp = logic::history_x10a_target_fingerprint(
            c.profile.c_str(), c.rx_pin, c.tx_pin, static_cast<char>(c.proto));
    // Stage every HomeHub value needed after persistence while the handler may still report an OOM
    // honestly. The post-save path below accepts only POD and is noexcept: a successful durable
    // write can therefore never become a false 503 or lose predecessor cleanup to a Config copy.
    const uint32_t modbus_target_fp = logic::history_homehub_target_fingerprint(
        config_modbus_host(c).c_str(), static_cast<uint32_t>(c.mb_port),
        static_cast<uint32_t>(c.mb_unit_id));
    const bool modbus_enabled = config_modbus_enabled(c);
    // This route owns TWO independent durability domains. An explicit X10A statement requires all
    // the atomic link-cache entry; a HomeHub-only request succeeds with the service blob and treats the
    // unchanged X10A cache as best-effort maintenance. Mixed requests were rejected above, so a 500
    // can no longer hide a HomeHub blob that already landed before a link-key failure.
    if (!config_save(c, /*require_link=*/x10a_sent))
        return send_err(req, "500 Internal Server Error", "config write failed");
    if (reset_checkup) {
        hp_poll_reconfigure();
        checkup_reset();
        dwell_reset();
        history_reset();
        if (c.x10a_identity_fp != 0) {
            checkup_reset_on_detect(c.profile.c_str());
            dwell_reset_on_detect(c.profile.c_str());
            history_reset_on_detect(c.x10a_identity_fp);
        }
    }
    if (reset_mb_history) {
        history_modbus_reset(modbus_target_fp);
        // The HomeHub stack is told separately, because it IS separate: this starts or stops its task
        // and re-resolves its address without touching the X10A poll engine above.
        mb_reconfigure(modbus_enabled);
        // Publish the tombstone only after generation, status and cache have crossed to the new
        // identity. mqtt_task can then never consume this request and republish predecessor A from
        // the same cycle before the HomeHub owner notices B/disabled.
        if (modbus_was_enabled) mqtt_request_modbus_cleanup();
    }
    return http_send_json(req, "{\"ok\":true}");
}

// Manual HomeHub discovery for the edit dialog. Unlike the one initial boot search, this does not
// save anything: the user sees the found IPv4 in the normal host field and decides with Save or
// Cancel whether it becomes configuration. A bounded miss returns control for manual entry.
static esp_err_t discover_homehub_now(httpd_req_t* req) {
    if (!net_is_up())
        return send_err(req, "400 Bad Request", "Network not connected");
    std::string found;
    if (!mb_discover_homehub(found))
        return send_err(req, "404 Not Found", "No HomeHub found");
    // mb_discover_homehub returns a numeric IPv4 assembled by firmware, never caller text.
    const std::string body = std::string("{\"ok\":true,\"host\":\"") + found + "\"}";
    return http_send_json(req, body.c_str());
}

static esp_err_t set_syslog(httpd_req_t* req) {
    char body[512];
    if (http_read_body(req, body, sizeof(body)) < 0) return send_err(req, "400 Bad Request", "bad body");
    cJSON* j = cJSON_Parse(body);
    if (!j) return send_err(req, "400 Bad Request", "bad json");
    std::string host = js(j, "host");
    int port = ji(j, "port", 514);
    cJSON_Delete(j);

    // Only the port range is validated synchronously (cheap). DNS resolution + reachability are done
    // asynchronously by the syslog task and surfaced via /status.syslog {resolved, reachable, error},
    // so the request path never blocks on a network probe. (/set_mqtt is the deliberate exception: it
    // pre-flights the broker connect synchronously so a bad address/credential is rejected at Save
    // rather than silently failing after the reboot — syslog is fire-and-forget UDP, MQTT is not.)
    if (!host.empty() && (port < 1 || port > 65535)) {
        httpd_resp_set_status(req, "400 Bad Request");
        return http_send_json(req, "{\"ok\":false,\"error\":\"port out of range\"}");
    }

    Config c = config();
    // Unchanged settings short-circuit — no NVS write, no reboot — exactly like /set_mqtt and
    // /set_ntp. A re-save of the same host/port would otherwise persist identical values and reboot,
    // dropping the poll cycle, MQTT availability and any open WebSocket for nothing. The UI already
    // handles {"reboot":false} (www/js/settings.js "No changes"). /set_wifi is deliberately NOT short-circuited:
    // a re-save there re-arms the credential-rollback trial.
    if (host == c.syslog_host && port == c.syslog_port)
        return http_send_json(req, "{\"ok\":true,\"reboot\":false}");
    c.syslog_host = host;
    c.syslog_port = port;
    if (!config_save(c)) {
        httpd_resp_set_status(req, "500 Internal Server Error");
        return http_send_json(req, "{\"ok\":false,\"error\":\"config write failed\"}");
    }
    http_send_json(req, "{\"ok\":true,\"reboot\":true}");
    reboot_soon();
    return ESP_OK;
}

// POST /set_ntp {server} -> persist + reboot, mirroring /set_syslog: no request-path network probe
// (the SNTP client resolves + retries on its own task after reboot), an empty server is accepted —
// config_load() reads it as "reset to the CONFIG_DAIKIN_NTP_SERVER compile-time default" — and the
// only validation here is the same shape a hostname/IP field ever gets in this codebase (none; the
// SNTP client itself just fails to resolve a garbage name and keeps retrying, same as a bad syslog
// host does today).
static esp_err_t set_ntp(httpd_req_t* req) {
    char body[256];
    if (http_read_body(req, body, sizeof(body)) < 0) return send_err(req, "400 Bad Request", "bad body");
    cJSON* j = cJSON_Parse(body);
    if (!j) return send_err(req, "400 Bad Request", "bad json");
    std::string server = js(j, "server");
    cJSON_Delete(j);

    Config c = config();
    if (server == c.ntp_server) return http_send_json(req, "{\"ok\":true,\"reboot\":false}");
    c.ntp_server = server;
    if (!config_save(c)) {
        httpd_resp_set_status(req, "500 Internal Server Error");
        return http_send_json(req, "{\"ok\":false,\"error\":\"config write failed\"}");
    }
    http_send_json(req, "{\"ok\":true,\"reboot\":true}");
    reboot_soon();
    return ESP_OK;
}

// POST /set_weather {latitude, longitude[, refresh]}. Two empty strings disable weather traffic;
// otherwise both strict decimal coordinates are required. Saving is local and non-blocking: the
// dedicated weather task performs TLS/DNS/JSON work only after this response. `refresh:true` is a
// deliberately narrow observation-only trigger: it is accepted only when the submitted location
// exactly matches the enabled saved location, so release HIL can schedule a real weather TLS cycle
// without changing or rewriting NVS.
static esp_err_t set_weather(httpd_req_t* req) {
    char body[256];
    if (http_read_body(req, body, sizeof(body)) < 0) return send_err(req, "400 Bad Request", "bad body");
    cJSON* j = cJSON_Parse(body);
    if (!j) return send_err(req, "400 Bad Request", "bad json");
    const std::string latitude = js(j, "latitude");
    const std::string longitude = js(j, "longitude");
    cJSON*            refresh_item = cJSON_GetObjectItemCaseSensitive(j, "refresh");
    if (refresh_item && !cJSON_IsBool(refresh_item)) {
        cJSON_Delete(j);
        return send_err(req, "400 Bad Request", "refresh must be boolean");
    }
    const bool refresh = cJSON_IsTrue(refresh_item);
    cJSON_Delete(j);
    const WeatherLocationParse location = weather_location_parse(latitude, longitude);
    if (!location.valid) {
        if (std::strcmp(location.reason, "both_coordinates_required") == 0)
            return send_err(req, "400 Bad Request", "latitude and longitude are both required");
        if (std::strcmp(location.reason, "invalid_latitude") == 0)
            return send_err(req, "400 Bad Request", "latitude must be between -90 and 90");
        return send_err(req, "400 Bad Request", "longitude must be between -180 and 180");
    }
    Config c = config();
    const bool weather_was_enabled = c.weather_enabled;
    const bool unchanged           = location.enabled == c.weather_enabled &&
                           location.latitude_e6 == c.weather_latitude_e6 &&
                           location.longitude_e6 == c.weather_longitude_e6;
    if (refresh) {
        if (!unchanged || !location.enabled)
            return send_err(req, "409 Conflict", "refresh requires the saved enabled location");
        if (!c.diagnostics_enabled)
            return send_err(req, "409 Conflict", "refresh requires diagnostics enabled");
        uint64_t refresh_token = 0;
        if (!weather_forecast_request_refresh(refresh_token))
            return send_err(req, "503 Service Unavailable",
                            "weather task unavailable or refresh already pending");
        char response[160];
        std::snprintf(response, sizeof(response),
                      "{\"ok\":true,\"reboot\":false,\"saved\":false,"
                      "\"refresh_requested\":true,\"refresh_token\":%llu}",
                      static_cast<unsigned long long>(refresh_token));
        return http_send_json(req, response);
    }
    if (unchanged) return http_send_json(req, "{\"ok\":true,\"reboot\":false,\"saved\":false}");
    c.weather_enabled = location.enabled;
    c.weather_latitude_e6 = location.latitude_e6;
    c.weather_longitude_e6 = location.longitude_e6;
    WeatherSourceChange weather_change(location.enabled, c.diagnostics_enabled);
    if (!weather_change)
        return send_err(req, "503 Service Unavailable",
                        "weather request still active; retry location change");
    if (!config_save(c)) return send_err(req, "500 Internal Server Error", "config write failed");
    weather_change.commit();
    if (weather_was_enabled) mqtt_request_weather_cleanup();
    weather_forecast_reconfigure();
    return http_send_json(req, "{\"ok\":true,\"reboot\":false,\"saved\":true}");
}

