0Bu/daikin-altherma-esp32/main/http_config.cpp
    if (!ui_lang_valid(lang)) return send_err(req, "400 Bad Request", "unknown language");

    Config c = config();
    const UiLang want = ui_lang_parse(lang);
    if (want == c.ui_lang) return http_send_json(req, "{\"ok\":true,\"reboot\":false}");
    c.ui_lang = want;
    if (!config_save(c)) return send_err(req, "500 Internal Server Error", "config write failed");
    diag_printf("ui: language set to %s\n", ui_lang_name(want));
    return http_send_json(req, "{\"ok\":true,\"reboot\":false}");
}

// Re-run auto-detection now (without waiting for a reboot): drop back to the "auto" sentinel +
// invalidate the fingerprint, so the next poll cycle sweeps protocol + re-fingerprints the unit
// (hp_poll.cpp poll_detect). Detection state is session-only, so this is a RAM-only reset.
static esp_err_t do_detect(httpd_req_t* req) {
    Config c   = config();
    c.profile  = "auto";
    c.fp_valid = false;
    config_set_runtime(c);
    hp_poll_reconfigure();
    checkup_reset();
    dwell_reset();
    history_reset();
    return http_send_json(req, "{\"ok\":true}");
}

// ── POST /hp/query — the free register probe (logic/hp_probe.hpp) ────────────────────────────────
// Ask the bus for ONE caller-chosen page and report the raw frame plus every decode the requested
// slice admits. This is the only route whose subject is a register the value catalog does not
// claim, and it is what makes a model nobody has mapped explorable without a rebuild.
//
// It is a POST despite reading nothing on the device, for one reason that is not style: it puts a
// frame on a shared physical bus and consumes a poll cycle's bus time. GET must stay the method
// that costs nothing, or a link prefetcher becomes a bus load.
//
// STATUS CODES SPLIT ALONG WHO FAILED. A malformed request is 400 and a second concurrent probe is
// 409 — the caller's problem. No poll task or an unserved request is 503 — ours. But a page the
// unit does not answer, refuses, or answers too short is a RESULT: the firmware did exactly what
// was asked and the finding is that this unit has nothing there. Those come back 200 with
// `ok:false` and a stable `status`, because a client exploring a register map will hit them
// constantly and an HTTP error would tell it the device is broken when it is working perfectly.
struct ProbeChunkEmitter {
    httpd_req_t* req = nullptr;
    bool operator()(std::string_view bytes, bool final) const {
        if (final) return httpd_resp_send_chunk(req, nullptr, 0) == ESP_OK;
        return httpd_resp_send_chunk(req, bytes.data(), bytes.size()) == ESP_OK;
    }
};
using ProbeJsonChunks = BoundedChunkSink<ProbeChunkEmitter, 1024>;

template <typename JsonOut>
static void probe_append_int(JsonOut& out, int value) {
    char b[16];
    snprintf(b, sizeof(b), "%d", value);
    out += b;
}

template <typename JsonOut>
static void probe_append_decode(JsonOut& out, const ProbeDecode& d) {
    out += "{\"conv\":";
    probe_append_int(out, d.conv);
    if (d.alias_count > 0) {
        out += ",\"aliases\":[";
        for (int i = 0; i < d.alias_count; i++) {
            if (i) out += ',';
            probe_append_int(out, d.alias[i]);
        }
        out += ']';
    }
    if (d.is_text) {
        out += ",\"text\":\"";
        json_append_escaped(out, d.text);
        out += '"';
    } else if (d.ok) {
        char b[32];
        snprintf(b, sizeof(b), "%.*f", display_decimals(d.conv), d.value);
        out += ",\"value\":";
        out += b;
    } else {
        // The converter ran and REFUSED these bytes (conv 405 on a non-positive pressure, 107/114
        // on the 0x8000 sentinel). Reported as its own state rather than omitted: "this converter
        // reads these bytes as the no-data marker" is the finding that separates a sentinel from a
        // real reading, and it is exactly the distinction a catalog row has to encode.
        out += ",\"refused\":true";
    }
    out += '}';
}

static esp_err_t hp_query_probe(httpd_req_t* req) {
    char body[192];
    if (http_read_body(req, body, sizeof(body)) < 0) return send_err(req, "400 Bad Request", "bad body");
    cJSON* j = cJSON_Parse(body);
    if (!j) return send_err(req, "400 Bad Request", "bad json");
    ProbeRequest q;
    q.reg    = ji(j, "reg", -1);
    q.offset = ji(j, "offset", 0);
    q.size   = ji(j, "size", 1);
    // No converter named = sweep. That is the DEFAULT on purpose: requiring an id before any value
    // is visible would ask the user to answer the question they came here to ask.
    q.conv   = cJSON_HasObjectItem(j, "conv") ? ji(j, "conv", PROBE_SWEEP) : PROBE_SWEEP;
    cJSON_Delete(j);

    const ProbeReject reject = probe_validate(q);
    if (reject != ProbeReject::None)
        return send_err(req, "400 Bad Request", probe_reject_name(reject));

    HpProbeReply reply;
    // 3 s: the poll cadence is 1 s and one sweep of a resolved profile can hold the bus for several
    // hundred ms per silent register, so a probe submitted just after a cycle started waits out the
    // rest of it plus its own 300 ms round-trip. Long enough that a healthy device never times out,
    // short enough that a browser is not left hanging on a wedged one.
    hp_probe_run(static_cast<uint8_t>(q.reg), reply, 3000);

    if (reply.status == ProbeStatus::Busy)
        return send_err(req, "409 Conflict", "another register probe is in flight");
    if (reply.status == ProbeStatus::NoLink || reply.status == ProbeStatus::Timeout)
        return send_err(req, "503 Service Unavailable", probe_status_name(reply.status));

    // ONE status, decided before a byte is emitted. The slice bound can only be applied after the
    // reply arrives, so the obvious shape appends a second `status` once the payload turns out to be
    // shorter than the caller assumed — and a JSON object with two `status` keys is a response whose
    // meaning depends on which one the parser keeps. Decide first, emit once.
    const bool sliced = reply.status == ProbeStatus::Ok &&
                        probe_slice_fits(q.offset, q.size, reply.payload_len);
    const ProbeStatus status = (reply.status == ProbeStatus::Ok && !sliced)
                                   ? ProbeStatus::OutOfBounds
                                   : reply.status;

    // Stage every potentially allocating snapshot/decode before sending the first chunk. Once the
    // response starts, formatting uses only fixed buffers and the sink's already-reserved 1 KiB.
    ProbeDecode decodes[PROBE_MAX_DECODES];
    int decode_count = 0;
    bool unimplemented = false;
    if (sliced) {
        const Config c = config();
        const def::Profile& prof = def::lookup(c.profile.c_str());
        const int rtype = profile_refrigerant(prof.values, prof.count);
        const uint8_t* payload = reply.frame + reply.payload_off;
        if (q.conv == PROBE_SWEEP) {
            decode_count = probe_sweep(payload, reply.payload_len, q.offset, q.size,
                                       decodes, PROBE_MAX_DECODES, rtype);
        } else {
            decode_count = probe_decode_one(payload, reply.payload_len, q.offset, q.size, q.conv,
                                            decodes[0], unimplemented, rtype) ? 1 : 0;
        }
    }

    char reg_hex[8], hex[3 * 64];
    snprintf(reg_hex, sizeof(reg_hex), "0x%02X", static_cast<unsigned>(q.reg));
    ProbeJsonChunks out(ProbeChunkEmitter{req});
    httpd_resp_set_type(req, "application/json");
    out += "{\"reg\":\"";
    out += reg_hex;
    out += "\",\"proto\":\"";
    out += static_cast<char>(reply.proto);
    out += "\",\"rx_pin\":"; probe_append_int(out, reply.rx_pin);
    out += ",\"tx_pin\":"; probe_append_int(out, reply.tx_pin);
    out += ",\"offset\":"; probe_append_int(out, q.offset);
    out += ",\"size\":"; probe_append_int(out, q.size);
    out += ",\"status\":\"";
    out += probe_status_name(status);
    out += '"';

    // Preserve every byte that arrived, including NAK, bad-CRC, unexpected-page and partial frames.
    if (reply.frame_len > 0) {
        hex_render(reply.frame, reply.frame_len, hex, static_cast<int>(sizeof(hex)));
        out += ",\"frame\":\""; out += hex; out += '"';
    }

    if (reply.status != ProbeStatus::Ok) {
        out += ",\"ok\":false}";
        return out.finish() ? ESP_OK : ESP_FAIL;
    }

