0Bu/daikin-altherma-esp32/main/http_config.cpp
    hex_render(reply.frame + reply.payload_off, reply.payload_len, hex,
               static_cast<int>(sizeof(hex)));
    out += ",\"payload\":\""; out += hex; out += "\",\"payload_len\":";
    probe_append_int(out, reply.payload_len);

    if (!sliced) {
        // The page is real and shorter than the caller assumed — already reported as out_of_bounds
        // above. A finding, not a transport error, and the payload hex just emitted shows exactly
        // how much there is.
        out += ",\"ok\":false}";
        return out.finish() ? ESP_OK : ESP_FAIL;
    }

    hex_render(reply.frame + reply.payload_off + q.offset, q.size, hex,
               static_cast<int>(sizeof(hex)));
    out += ",\"slice\":\""; out += hex; out += '"';

    out += ",\"ok\":true,\"decodes\":[";
    for (int i = 0; i < decode_count; i++) {
        if (i) out += ',';
        probe_append_decode(out, decodes[i]);
    }
    if (unimplemented) {
        out += "{\"conv\":";
        probe_append_int(out, q.conv);
        out += ",\"unimplemented\":true}";
    }
    out += "]}";
    return out.finish() ? ESP_OK : ESP_FAIL;
}

void http_register_config(httpd_handle_t s, HttpSurface surface) {
    // /set_wifi is the ONE config route the open setup AP exposes (it is how you provision the
    // network); http_register_on withholds the rest there (F01) — MQTT/syslog/NTP/HP config and
    // re-detect are trusted-LAN only, so a nearby radio client cannot reconfigure the device.
    http_register_on(s, surface, "/set_wifi", HTTP_POST, set_wifi);
    http_register_on(s, surface, "/set_mqtt", HTTP_POST, set_mqtt);
    http_register_on(s, surface, "/set_ref_temp", HTTP_POST, set_ref_temp);
    http_register_on(s, surface, "/test_circulation", HTTP_POST, test_circulation);
    http_register_on(s, surface, "/set_circulation", HTTP_POST, set_circulation);
    http_register_on(s, surface, "/set_syslog", HTTP_POST, set_syslog);
    http_register_on(s, surface, "/set_ntp", HTTP_POST, set_ntp);
    http_register_on(s, surface, "/set_weather", HTTP_POST, set_weather);
    http_register_on(s, surface, "/set_hp", HTTP_POST, set_hp);
    http_register_on(s, surface, "/discover_homehub", HTTP_POST, discover_homehub_now);
    http_register_on(s, surface, "/set_board", HTTP_POST, set_board);
    http_register_on(s, surface, "/set_env3", HTTP_POST, set_env3);
    http_register_on(s, surface, "/set_ota", HTTP_POST, set_ota);
    http_register_on(s, surface, "/set_lang", HTTP_POST, set_lang);
    http_register_on(s, surface, "/set_diagnostics", HTTP_POST, set_diagnostics);
    http_register_on(s, surface, "/detect", HTTP_POST, do_detect);
    http_register_on(s, surface, "/hp/query", HTTP_POST, hp_query_probe);
}

} // namespace daik
